# Homework

### Problem 1
In this question, we will use the csv file **Temp.csv**. 
- Read it into a data frame, call it `Temp`.

In [51]:
#### Your code here
import pandas as pd

df = pd.read_csv('Temp.csv')
df

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

- We learned that the temperature at New Haven, Connecticut is currently 58 degree fahrenheit. Add this information into the DataFrame.

In [55]:
df2 = pd.DataFrame([['New Haven','Connecticut',58]],columns=['City','State','Temperature'])
df2

        City        State  Temperature
0  New Haven  Connecticut           58

In [57]:
df3 = df.append(df2)

- Replace the names of the states by their abbreviations. That is 
    - Connecticut --> CT
    - New Jersey  --> NJ
    - New York    --> NY

In [66]:
#### Your code here
df3 = df3.replace('Connecticut','CT').replace('New Jersey','NJ').replace('New York','NY')

In [76]:
df3

         City State  Temperature
0         NYC    NY           67
1      Albany    NY           49
2     Buffalo    NY           38
3    Hartford    CT           63
4  Bridgeport    CT           58
5      Treton    NJ           72
6      Newark    NJ           68
0   New Haven    CT           58

- Select the rows in New York.

- What is the average of the temperature of cities in NY?

In [82]:
NYC = (df3.loc[df3['State'] == 'NY']).mean()

In [83]:
NYC

Temperature    51.333333
dtype: float64

- Find the mean and the standard deviation of the temperature of each state.

In [91]:
#### Your code here
states = df3.groupby('State')
print(states.mean(),'\n\n', states.std())

       Temperature
State
CT       59.666667
NJ       70.000000
NY       51.333333

        Temperature
State
CT        2.886751
NJ        2.828427
NY       14.640128

- We know the capital of each state: 
    - Connecticut --> Hartford
    - New Jersey  --> Treton
    - New York    --> Albany
    
    Create a data frame, `Capital`, with two columns: State and Capital, which should look like:
    
|| State| Capital|
| :-: |:---: | :---:|
| 0| CT  | Hartford|
| 1| NJ | Treton|
| 2| NY| Albany|

In [94]:
#### Your code here
Capital = \
pd.DataFrame([['Connecticut','Hartford'],['New Jersey','Treton'],['New York','Albany']]
             ,columns = ['State', 'Capital'])
Capital

         State   Capital
0  Connecticut  Hartford
1   New Jersey    Treton
2     New York    Albany

- Mutate a new boolean column, `Capital`, to `Temp`, which is `True` if the city in the row is the capital of the state, else `False`.

In [10]:
#### Your code here

         City State  Temperature Capital
0         NYC    NY           67   False
1      Albany    NY           49    True
2     Buffalo    NY           38   False
3    Hartford    CT           63    True
4  Bridgeport    CT           58   False
5   New Haven    CT           58   False
6      Treton    NJ           72    True
7      Newark    NJ           68   False

### Problem 2

- a. Load the Gross Domestic Product data for the 190 ranked countries in the file **GDP.csv**. Load **Country.csv** into a DataFrame. 
- b. Match the data based on the country shortcode. How many of the IDs match? 
- c. Sort the data frame in descending order by GDP rank. What is the 13th country in the resulting data frame? (Note: GDP formats as 123,456,789.)
- d. What is the average GDP for the "High income: OECD" and "High income: nonOECD" group?
- e. What is the average GDP for different income groups and regions?

In [183]:
#### Your code here
# (a)
import numpy as np
import pandas as pd
gdp = pd.read_csv('GDP.csv', skiprows=range(5), header= None, usecols=[0,1,3,4], nrows=190, encoding='ISO-8859-1')
gdp.columns = ['CountryCode', 'Rank', 'CountryName', 'GDP']
country = pd.read_csv('Country.csv', encoding='ISO-8859-1')

In [181]:
# (b)
gdp_detail = country.merge(gdp,on = 'CountryCode', how = 'inner')
#gdp.CountryCode
gdp_detail.CountryCode.count()

189

In [184]:
# (c)
#gdp_detail['GDP'] = (gdp_detail['GDP'].str.split()).apply(lambda x: float(x[0].replace(',', '')))
sorted_gdp = gdp_detail.sort_values('Rank', ascending=False)
sorted_gdp[12:13].CountryCode

68    GRD
Name: CountryCode, dtype: object

In [189]:
# (d)

#income_groups = gdp_detail[]
#gdp_detail.groupby('Income Group').agg({'GDP':'mean'})
gdp_detail[gdp_detail['Income Group']=='High income: nonOECD']

,CountryCode,Long Name,Income Group,Region,Lending category,Other groups,Currency Unit,Latest population census,Latest household survey,Special Notes,...,Latest industrial data,Latest trade data,Latest water withdrawal data,2-alpha code,WB-2 code,Table Name,Short Name,Rank,CountryName,GDP
0,ABW,Aruba,High income: nonOECD,Latin America & Caribbean,NaN,NaN,Aruban florin,2000,NaN,NaN,...,NaN,2008.0,NaN,AW,AW,Aruba,Aruba,161,Aruba,"2,584"
4,ARE,United Arab Emirates,High income: nonOECD,Middle East & North Africa,NaN,NaN,U.A.E. dirham,2005,NaN,NaN,...,NaN,2008.0,2005.0,AE,AE,United Arab Emirates,United Arab Emirates,32,United Arab Emirates,"348,595"
17,BHR,Kingdom of Bahrain,High income: nonOECD,Middle East & North Africa,NaN,NaN,Bahraini dinar,2001,NaN,NaN,...,NaN,2007.0,2003.0,BH,BH,Bahrain,Bahrain,93,Bahrain,"29,044"
18,BHS,Commonwealth of The Bahamas,High income: nonOECD,Latin America & Caribbean,NaN,NaN,Bahamian dollar,2000,NaN,The government has revised national accounts d...,...,1997.0,2008.0,NaN,BS,BS,"Bahamas, The",The Bahamas,138,"Bahamas, The","8,149"
22,BMU,The Bermudas,High income: nonOECD,North America,NaN,NaN,Bermuda dollar,2000,NaN,The Statistical Office has revised national ac...,...,NaN,2008.0,NaN,BM,BM,Bermuda,Bermuda,149,Bermuda,"5,474"
25,BRB,Barbados,High income: nonOECD,Latin America & Caribbean,NaN,NaN,Barbados dollar,2000,NaN,NaN,...,NaN,2008.0,2000.0,BB,BB,Barbados,Barbados,153,Barbados,"4,225"
26,BRN,Brunei Darussalam,High income: nonOECD,East Asia & Pacific,NaN,NaN,Brunei dollar,2001,NaN,NaN,...,NaN,2006.0,NaN,BN,BN,Brunei Darussalam,Brunei,113,Brunei Darussalam,"16,954"
42,CYP,Republic of Cyprus,High income: nonOECD,Europe & Central Asia,NaN,Euro area,Euro,2001,NaN,A simple multiplier is used to convert the nat...,...,2005.0,2008.0,2000.0,CY,CY,Cyprus,Cyprus,102,Cyprus,"22,767"
53,EST,Republic of Estonia,High income: nonOECD,Europe & Central Asia,NaN,NaN,Estonian kroon,2000,NaN,NaN,...,2005.0,2008.0,2000.0,EE,EE,Estonia,Estonia,103,Estonia,"22,390"
66,GNQ,Republic of Equatorial Guinea,High income: nonOECD,Sub-Saharan Africa,IBRD,NaN,CFA franc,2002,NaN,NaN,...,NaN,NaN,2000.0,GQ,GQ,Equatorial Guinea,Equatorial Guinea,110,Equatorial Guinea,"17,697"
71,HKG,Hong Kong Special Administrative Region of the...,High income: nonOECD,East Asia & Pacific,NaN,NaN,Hong Kong dollar,2006,NaN,On 1 July 1997 China resumed its exercise of s...,...,NaN,2008.0,NaN,HK,HK,"Hong Kong SAR, China","Hong Kong SAR, China",37,"Hong Kong SAR, China","263,259"
73,HRV,Republic of Croatia,High income: nonOECD,Europe & Central Asia,IBRD,NaN,Croatian kuna,2001,NaN,The Statistical Bureau has revised main GDP ag...,...,NaN,2008.0,NaN,HR,HR,Croatia,Croatia,71,Croatia,"59,228"
95,KWT,State of Kuwait,High income: nonOECD,Middle East & North Africa,NaN,NaN,Kuwaiti dinar,2005,"FHS, 1996",Fiscal year end: June 30; reporting period for...,...,NaN,2007.0,2002.0,KW,KW,Kuwait,Kuwait,56,Kuwait,"160,913"
104,LVA,Republic of Latvia,High income: nonOECD,Europe & Central Asia,NaN,NaN,Latvian lats,2000,NaN,NaN,...,2005.0,2008.0,2000.0,LV,LV,Latvia,Latvia,94,Latvia,"28,373"
105,MAC,Macao Special Administrative Region of the Peo...,High income: nonOECD,East Asia & Pacific,NaN,NaN,Macao pataca,2006,NaN,On 20 December 1999 China resumed its exercise...,...,NaN,2008.0,NaN,MO,MO,"Macao SAR, China","Macao SAR, China",82,"Macao SAR, China","43,582"
107,MCO,Principality of Monaco,High income: nonOECD,Europe & Central Asia,NaN,NaN,Euro,2008,NaN,NaN,...,NaN,NaN,NaN,MC,MC,Monaco,Monaco,147,Monaco,"6,075"
115,MLT,Republic of Malta,High income: nonOECD,Middle East & North Africa,NaN,Euro area,Euro (data reported in Maltese liri),2005,NaN,NaN,...,2004.0,2008.0,2000.0,MT,MT,Malta,Malta,137,Malta,"8,722"
131,OMN,Sultanate of Oman,High income: nonOECD,Middle East & North Africa,NaN,NaN,Rial Omani,2003,"FHS, 1995",NaN,...,2005.0,2008.0,2003.0,OM,OM,Oman,Oman,66,Oman,"69,972"
139,PRI,Puerto Rico,High income: nonOECD,Latin America & Caribbean,NaN,NaN,U.S. dollar,2000,"RHS, 1995/96",Fiscal year end: June 30; reporting period for...,...,NaN,NaN,NaN,PR,PR,Puerto Rico,Puerto Rico,61,Puerto Rico,"101,496"
142,QAT,State of Qatar,High income: nonOECD,Middle East & North Africa,NaN,NaN,Qatari riyal,2004,NaN,NaN,...,2005.0,2008.0,2005.0,QA,QA,Qatar,Qatar,54,Qatar,"171,476"
146,SAU,Kingdom of Saudi Arabia,High income: nonOECD,Middle East & North Africa,NaN,NaN,Saudi Arabian riyal,2004,"Demographic survey, 2007",NaN,...,2005.0,2007.0,2006.0,SA,SA,Saudi Arabia,Saudi Arabia,19,Saudi Arabia,"711,050"
149,SGP,Republic of Singapore,High income: nonOECD,East Asia & Pacific,NaN,NaN,Singapore dollar,2000,"General household, 2005",Fiscal year end: March 31; reporting period fo...,...,2005.0,2008.0,NaN,SG,SG,Singapore,Singapore,35,Singapore,"274,701"
169,TTO,Republic of Trinidad and Tobago,High income: nonOECD,Latin America & Caribbean,IBRD,NaN,Trinidad and Tobago dollar,2000,"MICS, 2006",NaN,...,2005.0,2008.0,2000.0,TT,TT,Trinidad and Tobago,Trinidad and Tobago,101,Trinidad and Tobago,"23,320"

In [23]:
# (e)

                                                            GDP
Income Group         Region
High income: OECD    East Asia & Pacific         2197267.750000
                     Europe & Central Asia        756704.434783
                     Middle East & North Africa   258217.000000
                     North America               9033012.000000
High income: nonOECD East Asia & Pacific          149624.000000
                     Europe & Central Asia         27766.600000
                     Latin America & Caribbean     27954.800000
                     Middle East & North Africa   214253.142857
                     North America                  5474.000000
                     Sub-Saharan Africa            17697.000000